a,b,c,d = gets.chomp.split(" ").map(&:to_i)

l = c.lcm(d)

puts (b - (a-1)) - ( ((b/c) - ((a-1)/c))  + ((b/d) - ((a-1)/d))  ) + ( (b/l) - ((a-1)/l) )
=begin
puts <<"EOS"
l       : #{l}
b/c     : #{(b/c)}
(a-1)/c : #{(a-1)/c}
b/d     : #{b/d}
(a-1)/d : #{(a-1)/d}
(b/l)   : #{b/l}
(a/l)   : #{(a-1)/l}
#{( (b / c) - ((a-1)/c) ) + ( (b / d) - ((a-1)/d) ) - ( (b/l) - (a / l) )}
EOS
puts(b - (a-1))
=end


#puts (b - a + 1) - ( ( (b / c) - ((a-1)/c) ) + ( (b / d) - ((a-1)/d) ) - ( (b/l) - (a / l) )) #最小公倍数)

# C，数式立ててO(1)~~~~~っつってたら最後の2個のテストケースで落ちてて真顔になってた
# 最小公倍数で割るとこ，A以上のAも含んでて落ちてたっぽい